'''
2. Написати функцію <bank> , яка працює за наступною логікою:
користувач робить вклад у розмірі <a> одиниць строком на <years> років
під <percents> відсотків (кожен рік сума вкладу збільшується на цей відсоток,
ці гроші додаються до суми вкладу і в наступному році на них також нараховуються відсотки).
Параметр <percents> є необов'язковим і має значення по замовчуванню <10> (10%). 
Функція повинна принтануть суму, яка буде на рахунку, а також її повернути (але округлену до копійок).
'''

def bank(first_sum, years, percent = 10):
    return first_sum * (1 + percent/100) ** years


input_sum = int(input('Введіть початкову суму на рахунку '))
year_count = int(input('На скільки років робите внесок? '))
result = bank(input_sum, year_count, 10)
print(f'Кінцева сума {result:.2f}')