'''
Банкомат 3.0
- реалізуйте видачу купюр за логікою видавання найменшої кількості купюр, але в межах наявних в банкоматі.
  Наприклад: 2560 --> 2х1000, 1х500, 3х20.
  Будьте обережні з "жадібним алгоритмом"! Видані купюри також мають бути “вилучені” з банкомату.
  Тобто якщо до операції в банкоматі було 5х1000, 5х500, 5х20 - має стати 3х1000, 4х500, 2х20.
- як і раніше, поповнення балансу користувача не впливає на кількість купюр. Їх кількість може змінювати лише інкасатор.
- обов’язкова реалізація таких дій (назви можете використовувати свої):
При запускі
Вхід
Реєстрація (з перевіркою валідності/складності введених даних)
Вихід
Для користувача
Баланс
Поповнення
Зняття
Історія транзакцій
Вихід на стартове меню
Для інкасатора
Наявні купюри/баланс тощо
Зміна кількості купюр
Повна історія операцій по банкомату (дії всіх користувачів та інкасаторів)
Вихід на стартове меню
'''
import sqlite3
import datetime


menu_entrance = {1: 'Ввійти',
                 2: 'Зареєструватись',
                 3: 'Вихід'
                 }
menu_admin = {1: 'Переглянути баланс банкомата',
              2: 'Змінити кількість кюпюр',
              3: 'Історія транзакцій банкомата',
              4:'До головного меню'
              }
menu_user = {1: 'Переглянути баланс',
             2: 'Поповнити баланс ',
             3: 'Зняти кошти',
             4: 'Історія транзакцій',
             5: 'До головного меню'
             }
coins = {'10': 0, '20': 0, '50': 0, '100': 0, '200': 0, '500': 0, '1000': 0}

def my_decorator(function):
    def wrapper(*args, **kwargs):
        print()
        print('-' * 25)
        result = function(*args, **kwargs)
        print('-' * 25)
        return result
    return wrapper


@my_decorator
def output_menu(menu):
    for key, val in menu.items():
        print(f'{key}. {val}')
            
        
def get_choice(menu):
    while True:
        choice = input('Ваш вибір: ')
        if choice.isdigit() and int(choice) in range(1, len(menu) + 1):
            choice = int(choice)
            break
        else:
            print(f'Вибір повинен бути числом в межах від 1 до {len(menu)}')
            print('Повторіть ввод.')
            print()
    return choice
  


output_menu(menu_user)
enter_choice = get_choice(menu_user)
print(enter_choice)