'''
2. Написати функцію, яка приймає два параметри: ім'я (шлях) файлу та кількість символів.
   Файл також додайте в репозиторій. На екран має бути виведений список із трьома блоками - символи з початку,
   із середини та з кінця файлу. Кількість символів в блоках - та, яка введена в другому параметрі. 
   Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі або,
   наприклад, файл із двох символів і треба вивести по одному символу, то що виводити на місці середнього
   блоку символів?). Не забудьте додати перевірку чи файл існує.
'''

def output_symbols(file_name, symbols_count):
    with open(file_name, 'r') as input_file:
        string = input_file.read()
    print(string)
        